app/controllers/species_controller.rb

SELECT "species".* FROM "species"
---
  def index
    @species = Species.all

INSERT INTO "species" ("name", "description", "img_url", "environment_id", "region_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "ss"], ["description", "ss"], ["img_url", "ss"], ["environment_id", 2], ["region_id", 3], ["created_at", "2021-07-27 02:26:48.045087"], ["updated_at", "2021-07-27 02:26:48.045087"]]
---
  def create
    @species = Species.new(species_params)

    if @species.save

UPDATE "species" SET "environment_id" = $1, "region_id" = $2, "updated_at" = $3 WHERE "species"."id" = $4  [["environment_id", 1], ["region_id", 3], ["updated_at", "2021-07-27 16:01:23.026222"], ["id", 1]]
---
  def update
    if @species.update(species_params)

DELETE FROM "species" WHERE "species"."id" = $1  [["id", 7]]
---
  def destroy
    @species.destroy

SELECT "species".* FROM "species" WHERE "species"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_species
      @species = Species.find(params[:id])